<?php
/**
 * @Author: rocky
 * Date: 2020/4/22
 * Time: 17:32
 */

return [
    200 => '成功',
    999 => '失败',
    422 => '表单验证失败',
    1001 => 'CODE授权失败',
    3001 => '登录账号或密码错误，请重新输入!',
    3002 => '账号已经被禁用，请联系管理员!',
    3003 => '账号密码错误超过重试次数',
    4000 => '请先登陆再访问',
    4001 => '授权失效,请重新登录',
    4002 => '授权失效,身份过期',
    4003 => '验证码错误',
    4004 => '暂无数据',
    4005 => '内容不存在/已删除',
    5000 => '手机号已经被占用',
    5005 => '文件上传失败',
    6001 => 'token无法续期',
    6002 => '密码已修改，请重新登录',
    6003 => '用户被删除/已注销，请重新登录',
    7001 => '钱包余额不足以付款，请选择其他方式',
    7002 => '暂未设置支付密码，请前往设置',
    7003 => '支付密码不正确，请重新输入',
];
